inline_asm.org
#+TITLE:     GCC Inline ASM
#+AUTHOR:    yannik
#+EMAIL:     yannik520@gmail.com
#+DATE:      <2020-10-07 Wed>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style.css" />
#+HTML_HEAD_EXTRA:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+LATEX_HEADER:

* Basic Inline
The format of basic inline assembly is very much straight forward, the format is as following:
asm("assembly code");
Example:
#+BEGIN_SRC asm
asm("nop");
#+END_SRC

* Extended Asm.
The extended assembly code format is:
#+BEGIN_SRC asm
asm(assembler template 
    : output operands /* optional */
    : input operands /* optional */
    : list of clobbered registers /* optional */);
#+END_SRC

** Assembler Template
The assembler template contains the set of assembly instructions that gets inserted inside the C program. 
each instruction should be enclosed withing double quotes, or the entire group of instructions should be within double quotes. 
Each instruction should also end with a delimiter. The valid delimiters are newline(\n) and semicolon(;). '\n' may be followed by a tab(\t).

Example:
#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

static inline void dbg(const void *str)
{
	__asm__ __volatile__(
		"push {lr}\n"
		"mov r0, %0\n"
		"bl printf\n"
		"pop {lr}"
		:: "p" (str));
}

int main(void)
{
    dbg("debug string\n");

    return 0;
}
#+END_SRC

*** Special format strings
In addition to the tokens described by the input, output, and goto operands, these tokens have special 
meanings in the assembler template:

|-------+-------------------------------------------------------------------|
| Token | Descriptions                                                      |
|-------+-------------------------------------------------------------------|
| '%%'  | Outputs a single '%' into the assembler code.                     |
|-------+-------------------------------------------------------------------|
| '%='  | Outputs a number that is unique to each instance of the asm       |
|       | statement in the entire compilation. This option is useful        |
|       | when creating local labels and referring to them multiple         |
|       | times in a single template that generates multiple assembler      |
|       | instructions.                                                     |
|-------+-------------------------------------------------------------------|
| '%{'  | Outputs '{', and '}' characters (respectively) into the assembler |
| '%}'  | code.                                                             |
|-------+-------------------------------------------------------------------|

'%|' outputs '|' character into the assembler code.

** Output Operands
C expressions serve as operands for the assembly instructions inside "asm". 
Each operand is written as first an operand constraint in double quotes. For output
operands, there'll be a constraint modifier also within the quotes and then follows
the C expression which stands for the operand. ie, "constraint" (C expression) is the
general form. For output operands an additional modifier will be there. Constraints are 
primarily used to decide the addressing modes for operands. They are also used in specifying the 
registers to be used.

If we use more than one operand, they are separated by comma. Each operand has this format:

[ [asmSbolicName] ] constraint (cvariablename)

*** asmSymbolicName

Specifies a symbolic name for the operand. Reference the name in the assembler template by enclosing
it in square brackets(i.e. '%[Value]'). The scope of the name is the asm statement that contains the definition. Any valid C 
variable name is acceptable, including names already in the surrounding code. No two operands within the same asm statement can use the same symbolic name.

When not using an asmSymbolicName, use the (zero-based) position of the operand in the list of operands in the assembler template. 
For example if there are three output operands, use '%0' in the template to refer to the first, '%1' for the second, and '%2' for the third.

*** constrint

A string constant specifying constraints on the placement of the operand; Output constraints must begin ith either '=' (a variable overwriting an existing value) or '+' (when reading and writing). When using '=', do not 
assume the location contains the existing value on entry to the asm, except when the operand is tied to an input; After the prefix, there must be one or more additional constraints that describe where the value resides. 
Common constraints include 'r' for register and 'm' for memory. When you list more than one possible location (for example, "=rm"), the compiler chooses the mode efficient on based on the current context. If you list as many 
alternates as the asm statement allows, ou permit the optimizers to produce the best possible code. If you ust use a specific register, but your Machine Constraints do not provide sufficient control to select the specific register 
you want, local register variables may provide a solution.

