inline_asm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-08 Thu 17:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GCC Inline ASM</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yannik" />
<link rel="stylesheet" type="text/css" href="./style.css" />
</head>
<body>
<div id="content">
<h1 class="title">GCC Inline ASM</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org10c8479">1. Basic Inline</a></li>
<li><a href="#org6e8cd5a">2. Extended Asm.</a>
<ul>
<li><a href="#org5d085c4">2.1. Assembler Template</a>
<ul>
<li><a href="#org014dae8">2.1.1. Special format strings</a></li>
</ul>
</li>
<li><a href="#orgf39d089">2.2. Output Operands</a>
<ul>
<li><a href="#orgbac00fc">2.2.1. asmSymbolicName</a></li>
<li><a href="#org7d7b81e">2.2.2. constrint</a></li>
<li><a href="#orgf7039e1">2.2.3. cvariablename</a></li>
</ul>
</li>
<li><a href="#org0f15613">2.3. Input Operands</a>
<ul>
<li><a href="#org757d9e9">2.3.1. asmSymbolicName</a></li>
<li><a href="#org5577098">2.3.2. constraint</a></li>
<li><a href="#orgc6c8004">2.3.3. cexpression</a></li>
</ul>
</li>
<li><a href="#org6bf2701">2.4. Clobbers and Scratch Registers</a></li>
</ul>
</li>
<li><a href="#org992fac4">3. More Recipes</a>
<ul>
<li><a href="#orgb21acee">3.1. Inline assembler as preprocessor macor</a></li>
<li><a href="#org865d0b4">3.2. C stub functions</a></li>
<li><a href="#org13b37dc">3.3. Forcing usage of specific registers</a></li>
<li><a href="#org6b2b118">3.4. Using constants</a></li>
</ul>
</li>
<li><a href="#org4d91960">4. References:</a></li>
</ul>
</div>
</div>

<div id="outline-container-org10c8479" class="outline-2">
<h2 id="org10c8479"><span class="section-number-2">1</span> Basic Inline</h2>
<div class="outline-text-2" id="text-1">
<p>
The format of basic inline assembly is very much straight forward, the format is as following:
asm("assembly code");
Example:
</p>
<div class="org-src-container">
<pre class="src src-asm">asm("nop");
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e8cd5a" class="outline-2">
<h2 id="org6e8cd5a"><span class="section-number-2">2</span> Extended Asm.</h2>
<div class="outline-text-2" id="text-2">
<p>
The extended assembly code format is:
</p>
<div class="org-src-container">
<pre class="src src-asm">asm(assembler template 
    : output operands /* optional */
    : input operands /* optional */
    : list of clobbered registers /* optional */);
</pre>
</div>
</div>

<div id="outline-container-org5d085c4" class="outline-3">
<h3 id="org5d085c4"><span class="section-number-3">2.1</span> Assembler Template</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The assembler template contains the set of assembly instructions that gets inserted inside the C program. 
each instruction should be enclosed withing double quotes, or the entire group of instructions should be within double quotes. 
Each instruction should also end with a delimiter. The valid delimiters are newline(\n) and semicolon(;). '\n' may be followed by a tab(\t).
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-asm">#include &lt;stdint.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

static inline void dbg(const void *str)
{
	__asm__ __volatile__(
		"push {lr}\n"
		"mov r0, %0\n"
		"bl printf\n"
		"pop {lr}"
		:: "p" (str));
}

int main(void)
{
    dbg("debug string\n");

    return 0;
}
</pre>
</div>
</div>

<div id="outline-container-org014dae8" class="outline-4">
<h4 id="org014dae8"><span class="section-number-4">2.1.1</span> Special format strings</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
In addition to the tokens described by the input, output, and goto operands, these tokens have special 
meanings in the assembler template:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Token</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">'%%'</td>
<td class="org-left">Outputs a single '%' into the assembler code.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'%='</td>
<td class="org-left">Outputs a number that is unique to each instance of the asm</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">statement in the entire compilation. This option is useful</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">when creating local labels and referring to them multiple</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">times in a single template that generates multiple assembler</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">instructions.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'%{'</td>
<td class="org-left">Outputs '{', and '}' characters (respectively) into the assembler</td>
</tr>

<tr>
<td class="org-left">'%}'</td>
<td class="org-left">code.</td>
</tr>
</tbody>
</table>

<p>
'%|' outputs '|' character into the assembler code.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf39d089" class="outline-3">
<h3 id="orgf39d089"><span class="section-number-3">2.2</span> Output Operands</h3>
<div class="outline-text-3" id="text-2-2">
<p>
C expressions serve as operands for the assembly instructions inside "asm". 
Each operand is written as first an operand constraint in double quotes. For output
operands, there'll be a constraint modifier also within the quotes and then follows
the C expression which stands for the operand. ie, "constraint" (C expression) is the
general form. For output operands an additional modifier will be there. Constraints are 
primarily used to decide the addressing modes for operands. They are also used in specifying the 
registers to be used.
</p>

<p>
If we use more than one operand, they are separated by comma. Each operand has this format:
</p>

<p>
[ [asmSbolicName] ] constraint (cvariablename)
</p>
</div>

<div id="outline-container-orgbac00fc" class="outline-4">
<h4 id="orgbac00fc"><span class="section-number-4">2.2.1</span> asmSymbolicName</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Specifies a symbolic name for the operand. Reference the name in the assembler template by enclosing
it in square brackets(i.e. '%[Value]'). The scope of the name is the asm statement that contains the definition. Any valid C 
variable name is acceptable, including names already in the surrounding code. No two operands within the same asm statement can use the same symbolic name.
</p>

<p>
When not using an asmSymbolicName, use the (zero-based) position of the operand in the list of operands in the assembler template. 
For example if there are three output operands, use '%0' in the template to refer to the first, '%1' for the second, and '%2' for the third.
</p>
</div>
</div>

<div id="outline-container-org7d7b81e" class="outline-4">
<h4 id="org7d7b81e"><span class="section-number-4">2.2.2</span> constrint</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
A string constant specifying constraints on the placement of the operand; Output constraints must begin ith either '<code>' (a variable overwriting an existing value) or '+' (when reading and writing). When using '</code>', do not 
assume the location contains the existing value on entry to the asm, except when the operand is tied to an input; After the prefix, there must be one or more additional constraints that describe where the value resides. 
Common constraints include 'r' for register and 'm' for memory. When you list more than one possible location (for example, "=rm"), the compiler chooses the mode efficient on based on the current context. If you list as many 
alternates as the asm statement allows, ou permit the optimizers to produce the best possible code. If you ust use a specific register, but your Machine Constraints do not provide sufficient control to select the specific register 
you want, local register variables may provide a solution.
</p>
</div>

<ol class="org-ol">
