inline_asm.org
**** Simple Constraints
The simplest kind of constraint is a string full of letters, each of which describes one kind of operand that is permitted. Here are the letters that are allowed:

|----------------+---------------------------------------------------------------------------------------------------------------------------|
| Constraint     | Descriptions                                                                                                              |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| whitespace     | Whitespace characters are ignored and can be inserted at any position except the first.                                   |
|                | This enables each alternative for different operands to be visually aligned in the machine                                |
|                | description even if they have different number of constraints and modifiers.                                              |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'm'            | A memory operand is allowed, with any kind of address that the machine supports in general.                               |
|                | Note that the letter used ofr the general memory constraint can be re-defied by a back end using                          |
|                | the TARGET_MEM_CONSTRAINT macro.                                                                                          |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'o'            | A memory operand is allowed, but only if the address is offsetable. This means that adding a small                        |
|                | integer (actually, the width in bytes of the operand, as determined by its machine mode) may be added                     |
|                | to the address and the result is also a valid memory address.                                                             |
|                | For example, an address which is constant is offsettable; so is an address that is the sumo of a register                 |
|                | and a constant (as long as a slightly larger constant is also within the range of address-offsets supported               |
|                | by the machine); but an autoincrement or autodescrement address is not offsettable. More complicated                      |
|                | indirect/indexed addresses may or may not be offsetable depending on the other addressing modes that the                  |
|                | machine supports.                                                                                                         |
|                | Note that in an output operand which can be matched by another operand, the constraint letter 'o' is valid                |
|                | only when accompanied by both '<' (if the target machine has predecrement addressing) and '>' (if the target              |
|                | machine has preincrement addressing).                                                                                     |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'V'            | A memory operand that is not offsetable. In other words, anything that would fit the 'm' constraint but not               |
|                | the 'o' constraint.                                                                                                       |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| '<'            | A memory operand with autodecrement addressing (either predecrement or postdescrement) is allowed. In inline              |
|                | asm this constraint is only allowed if the operand is used exactly once in an instruction that can handle the             |
|                | side effects. Not using an operand with '<' in constraint string in the inline asm pattern at all or using it             |
|                | in multiple instructions isn't valid, because the side effects wouldn't be performed or would be performed more           |
|                | than once.                                                                                                                |
|                | Furthermore, on some targets the operand with '<' in constraint string must be accompanied by special instruction         |
|                | suffixes like %U0 instruction suffix on PowerPC or %P0 on IA-64.                                                          |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| '>'            | A memory perand with autoincrement addressing (either preincrement or postincrement) is allowed. In inline asm the        |
|                | same restrictions as for '<' apply.                                                                                       |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'r'            | A register operand is allowed provided that it is in a general register.                                                  |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'i'            | An immediate integer operand (one with constant value) is allowed. This includes symbolic constants whose values will     |
|                | be known only at assembly time or later.                                                                                  |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'n'            | An immediate integer operand with a known numeric value is allowed. Many systems cannot support assembly-time constants   |
|                | for opernds less than a word wide. Constraints for these operads should use 'n' rather than 'i'.                          |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'I','J','K',   | Other letters in the range 'I' througth 'P' may be defined in a machine-dependent fashion to permit immediate integer     |
| ... 'P'        | operands with explict integer values in specified ranges. For example, on the 68000, 'I' is defined to stand for the      |
|                | range of values 1 to 8. This is the range permitted as a shift count in the sift instructions.                            |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'E'            | An immediate floating operand (expression code const_double) is allowed, but only if the target floating point format is  |
|                | the same as that of the host machine (on which the compiler is running).                                                  |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'F'            | An immediate floating operand (expression code const_double or const_vector) is allowed.                                  |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'G', 'H'       | 'G' and 'H' may be defined in a machine-depedent fashion to permit immediate floating operands in particular ranges of    |
|                | values.                                                                                                                   |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 's'            | An immediate integer operand whose value is not an explicit integer is allowed.                                           |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'g'            | Any register, memory or immediate integer operand is allowed, except for registers that are not general registers.        |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'X'            | Any operand whatsoever is allowed.                                                                                        |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| '0', '1', '2', | An operand that matches the specified operand number is allowed. If a digit is used together with letters within the same |
| ... '9'        | alternative, the digit should come last.                                                                                  |
|                | This is called a matching constraint and what it really means is that the assembler has only a single operand that fills  |
|                | two roles which asm distinguishes. For example, an add instruction uses two input operands and an output operand, but on  |
|                | most CISC machines an add instruction really has only two operands, one of them an input-output operand.                  |
|----------------+---------------------------------------------------------------------------------------------------------------------------|
| 'p'            | An operand that is a valid memory address is allowed. This is for "load address" and "push address" instructions.         |
|----------------+---------------------------------------------------------------------------------------------------------------------------|

