inline_asm.html
<li><a id="org5c40dc2"></a>Simple Constraints<br />
<div class="outline-text-5" id="text-2-2-2-1">
<p>
The simplest kind of constraint is a string full of letters, each of which describes one kind of operand that is permitted. Here are the letters that are allowed:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Constraint</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">whitespace</td>
<td class="org-left">Whitespace characters are ignored and can be inserted at any position except the first.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">This enables each alternative for different operands to be visually aligned in the machine</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">description even if they have different number of constraints and modifiers.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'m'</td>
<td class="org-left">A memory operand is allowed, with any kind of address that the machine supports in general.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Note that the letter used ofr the general memory constraint can be re-defied by a back end using</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the TARGET<sub>MEM</sub><sub>CONSTRAINT</sub> macro.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'o'</td>
<td class="org-left">A memory operand is allowed, but only if the address is offsetable. This means that adding a small</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">integer (actually, the width in bytes of the operand, as determined by its machine mode) may be added</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">to the address and the result is also a valid memory address.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">For example, an address which is constant is offsettable; so is an address that is the sumo of a register</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">and a constant (as long as a slightly larger constant is also within the range of address-offsets supported</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">by the machine); but an autoincrement or autodescrement address is not offsettable. More complicated</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">indirect/indexed addresses may or may not be offsetable depending on the other addressing modes that the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">machine supports.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Note that in an output operand which can be matched by another operand, the constraint letter 'o' is valid</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">only when accompanied by both '&lt;' (if the target machine has predecrement addressing) and '&gt;' (if the target</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">machine has preincrement addressing).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'V'</td>
<td class="org-left">A memory operand that is not offsetable. In other words, anything that would fit the 'm' constraint but not</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the 'o' constraint.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'&lt;'</td>
<td class="org-left">A memory operand with autodecrement addressing (either predecrement or postdescrement) is allowed. In inline</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">asm this constraint is only allowed if the operand is used exactly once in an instruction that can handle the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">side effects. Not using an operand with '&lt;' in constraint string in the inline asm pattern at all or using it</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">in multiple instructions isn't valid, because the side effects wouldn't be performed or would be performed more</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">than once.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Furthermore, on some targets the operand with '&lt;' in constraint string must be accompanied by special instruction</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">suffixes like %U0 instruction suffix on PowerPC or %P0 on IA-64.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'&gt;'</td>
<td class="org-left">A memory perand with autoincrement addressing (either preincrement or postincrement) is allowed. In inline asm the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">same restrictions as for '&lt;' apply.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'r'</td>
<td class="org-left">A register operand is allowed provided that it is in a general register.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'i'</td>
<td class="org-left">An immediate integer operand (one with constant value) is allowed. This includes symbolic constants whose values will</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">be known only at assembly time or later.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'n'</td>
<td class="org-left">An immediate integer operand with a known numeric value is allowed. Many systems cannot support assembly-time constants</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">for opernds less than a word wide. Constraints for these operads should use 'n' rather than 'i'.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'I','J','K',</td>
<td class="org-left">Other letters in the range 'I' througth 'P' may be defined in a machine-dependent fashion to permit immediate integer</td>
</tr>

<tr>
<td class="org-left">&#x2026; 'P'</td>
<td class="org-left">operands with explict integer values in specified ranges. For example, on the 68000, 'I' is defined to stand for the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">range of values 1 to 8. This is the range permitted as a shift count in the sift instructions.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'E'</td>
<td class="org-left">An immediate floating operand (expression code const<sub>double</sub>) is allowed, but only if the target floating point format is</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the same as that of the host machine (on which the compiler is running).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'F'</td>
<td class="org-left">An immediate floating operand (expression code const<sub>double</sub> or const<sub>vector</sub>) is allowed.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'G', 'H'</td>
<td class="org-left">'G' and 'H' may be defined in a machine-depedent fashion to permit immediate floating operands in particular ranges of</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">values.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'s'</td>
<td class="org-left">An immediate integer operand whose value is not an explicit integer is allowed.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'g'</td>
<td class="org-left">Any register, memory or immediate integer operand is allowed, except for registers that are not general registers.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'X'</td>
<td class="org-left">Any operand whatsoever is allowed.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'0', '1', '2',</td>
<td class="org-left">An operand that matches the specified operand number is allowed. If a digit is used together with letters within the same</td>
</tr>

<tr>
<td class="org-left">&#x2026; '9'</td>
<td class="org-left">alternative, the digit should come last.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">This is called a matching constraint and what it really means is that the assembler has only a single operand that fills</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">two roles which asm distinguishes. For example, an add instruction uses two input operands and an output operand, but on</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">most CISC machines an add instruction really has only two operands, one of them an input-output operand.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'p'</td>
<td class="org-left">An operand that is a valid memory address is allowed. This is for "load address" and "push address" instructions.</td>
</tr>
</tbody>
</table>
</div>
</li>
