inline_asm.org
**** Constraints for Particular Machines
Whenever possible, you should use the general-purpose constraint letters in asm arguments, since they will convey meaning more readily to people
reading your code. Failing that, use the constraint letters that usually have very similar meanings across architectures. The most commonly used 
constraints are 'm' and 'r' (for memory and general-purpose registers respectively), and 'I', usually the letter indicating the most common 
immediate-constant format.

Each architecture define additional constraints. These constraints are used by the compiler itself for instruction generation, as well as for asm 
statements; therefore, some of the constraints are not particularly useful for asm. Here is a summary of some of the machine-dependent constraints 
available on some particular machines; it includes both constraints that are useful for asm and constraints that aren't. The compiler source file mentioned 
in the table heading for each architecture is the definitive reference for the meanings of that architecure's constraints.

#+caption: AArch64 family
| Constraint | Descriptions                                                                               |
|------------+--------------------------------------------------------------------------------------------|
| k          | The stack pointer register (SP)                                                            |
|------------+--------------------------------------------------------------------------------------------|
| w          | Floating point register, Advanced SIMD vector register or SVE vector register              |
|------------+--------------------------------------------------------------------------------------------|
| x          | Like w, but restricted to registers 0 to 15 inclusive.                                     |
|------------+--------------------------------------------------------------------------------------------|
| y          | Like w, but restricted to registers 0 to 7 inclusive.                                      |
|------------+--------------------------------------------------------------------------------------------|
| Upl        | One of the low eight SVE predicate registers (P0 to P7)                                    |
|------------+--------------------------------------------------------------------------------------------|
| Upa        | Any of the SVE predicate registers (P0 to P15)                                             |
|------------+--------------------------------------------------------------------------------------------|
| I          | Integer constant that is valid as an immediate operand in an ADD instruction               |
|------------+--------------------------------------------------------------------------------------------|
| J          | Integer constant that is valid as an immediate operand in a SUB instruction (once negated) |
|------------+--------------------------------------------------------------------------------------------|
| K          | Integer constant that can be used with a 32-bit logical instruction                        |
|------------+--------------------------------------------------------------------------------------------|
| L          | Integer constant that can be used with a 64-bit logical instruction                        |
|------------+--------------------------------------------------------------------------------------------|
| M          | Integer constant that is valid as an immediate operand in a 32-bit MOV pseudo instruction. |
|            | The MOV may be assembled to one of several different machine instructions depending on the |
|            | value.                                                                                     |
|------------+--------------------------------------------------------------------------------------------|
| N          | Integer constant that is valid as an immediate operant in a 64-bit MOV pseudo instruction  |
|------------+--------------------------------------------------------------------------------------------|
| S          | An absolute symbolic address or a label reference                                          |
|------------+--------------------------------------------------------------------------------------------|
| Y          | Floating point constant zero                                                               |
|------------+--------------------------------------------------------------------------------------------|
| Z          | Integer constant zero                                                                      |
|------------+--------------------------------------------------------------------------------------------|
| Ush        | The high part (bits 12 and upwards) of the pc-relative address of a symbol within 4GB of   |
|            | the istruction                                                                             |
|------------+--------------------------------------------------------------------------------------------|
| Q          | A memory address which uses a single base register with no offset                          |
|------------+--------------------------------------------------------------------------------------------|
| Ump        | A memory address suitable for a load/store pair instruction in SI, DI, SF and DF modes     |
|------------+--------------------------------------------------------------------------------------------|



#+caption: ARM family
|------------+---------------------------------------------------------------------------------------------|
| Constraint | Descriptions                                                                                |
|------------+---------------------------------------------------------------------------------------------|
| h          | In Thumb state, the core registers r8-r15                                                   |
|------------+---------------------------------------------------------------------------------------------|
| k          | The stack pointer register                                                                  |
|------------+---------------------------------------------------------------------------------------------|
| l          | In Thumb State the core registers r0-r7. In ARM state this is an alias for the r constraint |
|------------+---------------------------------------------------------------------------------------------|
| t          | VFP floating-point registers s0-s31. Used for 32 bit values.                                |
|------------+---------------------------------------------------------------------------------------------|
| w          | VFP floting-point registers d0-d31 and the appropriate subset d0-d15 based on command line  |
|            | options. Used for 64 bit values only. Not valid for Thumb1.                                 |
|------------+---------------------------------------------------------------------------------------------|
| y          | The iWMMX co-processor registers.                                                           |
|------------+---------------------------------------------------------------------------------------------|
| z          | The iWMMX RG registers.                                                                     |
|------------+---------------------------------------------------------------------------------------------|
| G          | The floating-point constant 0.0                                                             |
|------------+---------------------------------------------------------------------------------------------|
| I          | Integer that is valid as an immediate operand in a data processing instruction. That is, an |
|            | integer in the range 0 to 255 rotated by a multiple of 2                                    |
|------------+---------------------------------------------------------------------------------------------|
| J          | Integer in the range -4095 to 4095                                                          |
|------------+---------------------------------------------------------------------------------------------|
| K          | Integer that satisfies constraint 'I' when inverted (ones complement)                       |
|------------+---------------------------------------------------------------------------------------------|
| L          | Interger that satisfies constraint 'I' when negated (twos complement)                       |
|------------+---------------------------------------------------------------------------------------------|
| M          | Integer in the range 0 to 32                                                                |
|------------+---------------------------------------------------------------------------------------------|
| Q          | A memory reference where the exact address is in a single register ("m" is preferable for   |
|            | asm statements)                                                                             |
|------------+---------------------------------------------------------------------------------------------|
| R          | An item in the constant pool                                                                |
|------------+---------------------------------------------------------------------------------------------|
| S          | A symbol in the text segment of the current file                                            |
|------------+---------------------------------------------------------------------------------------------|
| Uv         | A memory reference suitable for VFP load/store insns (reg+constant offset)                  |
|------------+---------------------------------------------------------------------------------------------|
| Uy         | A memory reference suitable for iWMMXt load/store instructions.                             |
|------------+---------------------------------------------------------------------------------------------|
| Uq         | A memory reference suitable for the ARMv4 ldrsb instruction.                                |
|------------+---------------------------------------------------------------------------------------------|

