inline_asm.html

<li><a id="orgd63c804"></a>Constraints for Particular Machines<br />
<div class="outline-text-5" id="text-2-2-2-2">
<p>
Whenever possible, you should use the general-purpose constraint letters in asm arguments, since they will convey meaning more readily to people
reading your code. Failing that, use the constraint letters that usually have very similar meanings across architectures. The most commonly used 
constraints are 'm' and 'r' (for memory and general-purpose registers respectively), and 'I', usually the letter indicating the most common 
immediate-constant format.
</p>

<p>
Each architecture define additional constraints. These constraints are used by the compiler itself for instruction generation, as well as for asm 
statements; therefore, some of the constraints are not particularly useful for asm. Here is a summary of some of the machine-dependent constraints 
available on some particular machines; it includes both constraints that are useful for asm and constraints that aren't. The compiler source file mentioned 
in the table heading for each architecture is the definitive reference for the meanings of that architecure's constraints.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> AArch64 family</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Constraint</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">k</td>
<td class="org-left">The stack pointer register (SP)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">w</td>
<td class="org-left">Floating point register, Advanced SIMD vector register or SVE vector register</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">x</td>
<td class="org-left">Like w, but restricted to registers 0 to 15 inclusive.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">y</td>
<td class="org-left">Like w, but restricted to registers 0 to 7 inclusive.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Upl</td>
<td class="org-left">One of the low eight SVE predicate registers (P0 to P7)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Upa</td>
<td class="org-left">Any of the SVE predicate registers (P0 to P15)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">I</td>
<td class="org-left">Integer constant that is valid as an immediate operand in an ADD instruction</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">J</td>
<td class="org-left">Integer constant that is valid as an immediate operand in a SUB instruction (once negated)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">K</td>
<td class="org-left">Integer constant that can be used with a 32-bit logical instruction</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">L</td>
<td class="org-left">Integer constant that can be used with a 64-bit logical instruction</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">M</td>
<td class="org-left">Integer constant that is valid as an immediate operand in a 32-bit MOV pseudo instruction.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">The MOV may be assembled to one of several different machine instructions depending on the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">value.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">N</td>
<td class="org-left">Integer constant that is valid as an immediate operant in a 64-bit MOV pseudo instruction</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">S</td>
<td class="org-left">An absolute symbolic address or a label reference</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Y</td>
<td class="org-left">Floating point constant zero</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Z</td>
<td class="org-left">Integer constant zero</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ush</td>
<td class="org-left">The high part (bits 12 and upwards) of the pc-relative address of a symbol within 4GB of</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the istruction</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Q</td>
<td class="org-left">A memory address which uses a single base register with no offset</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ump</td>
<td class="org-left">A memory address suitable for a load/store pair instruction in SI, DI, SF and DF modes</td>
</tr>
</tbody>
</table>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> ARM family</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Constraint</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">h</td>
<td class="org-left">In Thumb state, the core registers r8-r15</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">k</td>
<td class="org-left">The stack pointer register</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">l</td>
<td class="org-left">In Thumb State the core registers r0-r7. In ARM state this is an alias for the r constraint</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">t</td>
<td class="org-left">VFP floating-point registers s0-s31. Used for 32 bit values.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">w</td>
<td class="org-left">VFP floting-point registers d0-d31 and the appropriate subset d0-d15 based on command line</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">options. Used for 64 bit values only. Not valid for Thumb1.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">y</td>
<td class="org-left">The iWMMX co-processor registers.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">z</td>
<td class="org-left">The iWMMX RG registers.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">G</td>
<td class="org-left">The floating-point constant 0.0</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">I</td>
<td class="org-left">Integer that is valid as an immediate operand in a data processing instruction. That is, an</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">integer in the range 0 to 255 rotated by a multiple of 2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">J</td>
<td class="org-left">Integer in the range -4095 to 4095</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">K</td>
<td class="org-left">Integer that satisfies constraint 'I' when inverted (ones complement)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">L</td>
<td class="org-left">Interger that satisfies constraint 'I' when negated (twos complement)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">M</td>
<td class="org-left">Integer in the range 0 to 32</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Q</td>
<td class="org-left">A memory reference where the exact address is in a single register ("m" is preferable for</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">asm statements)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">R</td>
<td class="org-left">An item in the constant pool</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">S</td>
<td class="org-left">A symbol in the text segment of the current file</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Uv</td>
<td class="org-left">A memory reference suitable for VFP load/store insns (reg+constant offset)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Uy</td>
<td class="org-left">A memory reference suitable for iWMMXt load/store instructions.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Uq</td>
<td class="org-left">A memory reference suitable for the ARMv4 ldrsb instruction.</td>
</tr>
</tbody>
</table>
</div>
</li>
