inline_asm.org
**** Constraint Modifier Characters
Here are constraint modifier characters.
| Modifier | Descriptions                                                                                            |
|----------+---------------------------------------------------------------------------------------------------------|
| '='      | Means that this operand is written to by this instruction: the previous value is discarded and          |
|          | replaced by new data.                                                                                   |
|          | Write-only operand, usuall used for all output operands.                                                |
|----------+---------------------------------------------------------------------------------------------------------|
| '+'      | Means that this operand is both read and written by the instruction.                                    |
|          | When the compiler fixes up the operands to satify the constraints, it needs to know which               |
|          | operands are read by the instruction and which are written by it. '=' identifies an operand             |
|          | which is only written; '+' identifies an operand that is both read and written; all other               |
|          | operands are assumed to only be read.                                                                   |
|          | If you specify '=' or '+' in a constraint, you put it in the first character of the constraint          |
|          | string.                                                                                                 |
|          | Read-Write operand, must be listed as an output operand.                                                |
|----------+---------------------------------------------------------------------------------------------------------|
| '&'      | Means (in a particular alternative) that this operand is an earlyclobber operand, which is written      |
|          | before the instruction is finished using the input operands. Therefore, this operand may not lie in     |
|          | a register that is read by the instruction or as part of any memory address.                            |
|          | '&' applies only to the alternative in which it is written. In constraints with multiple alternatives,  |
|          | sometimes one alternative requires '&' while others do not.                                             |
|          | A register that should be used for output only.                                                         |
|----------+---------------------------------------------------------------------------------------------------------|
| '%'      | Declares the instruction to be comutative for this operand and the following operand. This means that   |
|          | the compiler may interchange the two operands if that is the cheapest way to make all operands fit the  |
|          | constraints. '%' applies to all alternatives and must appear as the first character int the constraint. |
|          | Only read-only operands can use '%'.                                                                    |
|----------+---------------------------------------------------------------------------------------------------------|


*** cvariablename

Specifies a C lvalue expression to hold the output, typically a variable name. The enclosing parentheses are a required part of the syntax.

When the compiler selects the registers to use to represent the output operands it does not use any of the clobbered registers.

Output operand expressions must be lvalues. The compiler cannot check whether the operands have data types that are reasonable for the instruction being executed. For output expressions that are not directly addressable(for example a bit-field), 
the constraint must allow a register. In that case, GCC uses the register as the output of the asm, and then stores that register into the output.

Operands using the '+' constraint modifier count as two operands (that is, both as input and output) towards the total maximum of 30 operands per asm satement.

Use the '&' constraint modifier on all output operands that must not overlap an input. Otherwise, GCC may allocate the output operand in the same register as an unrelated input operand, on the assumption that the assembler code consumes its inputs before producing outputs. This 
assumption may be false if the assembler code actually consists of more than one instruction.

Example:

#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

static inline uint32_t read_register(uint32_t *reg)
{
	uint32_t value;

	__asm__ __volatile__(
		"mov %0, %1\n"
		: "=rm" (value)
		: "rm" (*reg)
		);

	return value;
}

int main(void)
{
    uint32_t reg = 0x80;
    printf("register value: %lx\n", read_register(&reg));

    return 0;
}
#+END_SRC

This code makes no use of the optional asmSymbolicName. Therefore it references the first output operand as %0, 
and the first input operand as %1.

Here, value may either be in a register or in memory. Since the compiler might already have the current value of the uint32_t location pointed to by reg in a 
register, you can enable it to choose the best location for value by specifying both constraints.

#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

static inline uint32_t read_register(uint32_t *reg)
{
	uint32_t value;

	__asm__ __volatile__(
		"mov %[val], %[reg]\n"
		: [val] "=rm" (value)
		: [reg] "rm" (*reg)
		);

	return value;
}

int main(void)
{
    uint32_t reg = 0x80;
    printf("register value: %lx\n", read_register(&reg));

    return 0;
}
#+END_SRC

Here use asmSymbolicName instead of digital index.

** Input Operands
Input operands make values form C variables and expressions avaliable to the assembly code.

Operands are separated by commas. Each operand has this format:

[ [asmSymbolicName] ] constraint (cxepression)

*** asmSymbolicName
Specifies a symbolic name for the operand. Reference the name in the assembler template by enclosing it in square brackets (i.e. '%[Value]'). The 
scope of the name is the asm statement that contains the definition. Any valid C variable name is acceptable, including names already defined in the surrounding code.
No two operands within the same asm statement can use the same symbolic name.

When not using an asmSymbolicName, use the (zero-based) position of the operand in the list of operands in the assembler template.
For example if there are two output operands and three inputs, use '%2' in the template to refer to the first input operand, '%3' for the second, and '%4' for the third.

