inline_asm.html

<li><a id="org1220724"></a>Constraint Modifier Characters<br />
<div class="outline-text-5" id="text-2-2-2-3">
<p>
Here are constraint modifier characters.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modifier</th>
<th scope="col" class="org-left">Descriptions</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">'='</td>
<td class="org-left">Means that this operand is written to by this instruction: the previous value is discarded and</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">replaced by new data.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Write-only operand, usuall used for all output operands.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'+'</td>
<td class="org-left">Means that this operand is both read and written by the instruction.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">When the compiler fixes up the operands to satify the constraints, it needs to know which</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">operands are read by the instruction and which are written by it. '=' identifies an operand</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">which is only written; '+' identifies an operand that is both read and written; all other</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">operands are assumed to only be read.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">If you specify '=' or '+' in a constraint, you put it in the first character of the constraint</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">string.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Read-Write operand, must be listed as an output operand.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'&amp;'</td>
<td class="org-left">Means (in a particular alternative) that this operand is an earlyclobber operand, which is written</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">before the instruction is finished using the input operands. Therefore, this operand may not lie in</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a register that is read by the instruction or as part of any memory address.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">'&amp;' applies only to the alternative in which it is written. In constraints with multiple alternatives,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sometimes one alternative requires '&amp;' while others do not.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A register that should be used for output only.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">'%'</td>
<td class="org-left">Declares the instruction to be comutative for this operand and the following operand. This means that</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the compiler may interchange the two operands if that is the cheapest way to make all operands fit the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">constraints. '%' applies to all alternatives and must appear as the first character int the constraint.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Only read-only operands can use '%'.</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>


<div id="outline-container-orgf7039e1" class="outline-4">
<h4 id="orgf7039e1"><span class="section-number-4">2.2.3</span> cvariablename</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Specifies a C lvalue expression to hold the output, typically a variable name. The enclosing parentheses are a required part of the syntax.
</p>

<p>
When the compiler selects the registers to use to represent the output operands it does not use any of the clobbered registers.
</p>

<p>
Output operand expressions must be lvalues. The compiler cannot check whether the operands have data types that are reasonable for the instruction being executed. For output expressions that are not directly addressable(for example a bit-field), 
the constraint must allow a register. In that case, GCC uses the register as the output of the asm, and then stores that register into the output.
</p>

<p>
Operands using the '+' constraint modifier count as two operands (that is, both as input and output) towards the total maximum of 30 operands per asm satement.
</p>

<p>
Use the '&amp;' constraint modifier on all output operands that must not overlap an input. Otherwise, GCC may allocate the output operand in the same register as an unrelated input operand, on the assumption that the assembler code consumes its inputs before producing outputs. This 
assumption may be false if the assembler code actually consists of more than one instruction.
</p>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-asm">#include &lt;stdint.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

static inline uint32_t read_register(uint32_t *reg)
{
	uint32_t value;

	__asm__ __volatile__(
		"mov %0, %1\n"
		: "=rm" (value)
		: "rm" (*reg)
		);

	return value;
}

int main(void)
{
    uint32_t reg = 0x80;
    printf("register value: %lx\n", read_register(&amp;reg));

    return 0;
}
</pre>
</div>

<p>
This code makes no use of the optional asmSymbolicName. Therefore it references the first output operand as %0, 
and the first input operand as %1.
</p>

<p>
Here, value may either be in a register or in memory. Since the compiler might already have the current value of the uint32<sub>t</sub> location pointed to by reg in a 
register, you can enable it to choose the best location for value by specifying both constraints.
</p>

<div class="org-src-container">
<pre class="src src-asm">#include &lt;stdint.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

static inline uint32_t read_register(uint32_t *reg)
{
	uint32_t value;

	__asm__ __volatile__(
		"mov %[val], %[reg]\n"
		: [val] "=rm" (value)
		: [reg] "rm" (*reg)
		);

	return value;
}

int main(void)
{
    uint32_t reg = 0x80;
    printf("register value: %lx\n", read_register(&amp;reg));

    return 0;
}
</pre>
</div>

<p>
Here use asmSymbolicName instead of digital index.
</p>
</div>
</div>
</div>

<div id="outline-container-org0f15613" class="outline-3">
<h3 id="org0f15613"><span class="section-number-3">2.3</span> Input Operands</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Input operands make values form C variables and expressions avaliable to the assembly code.
</p>

<p>
Operands are separated by commas. Each operand has this format:
</p>

<p>
[ [asmSymbolicName] ] constraint (cxepression)
</p>
</div>

<div id="outline-container-org757d9e9" class="outline-4">
<h4 id="org757d9e9"><span class="section-number-4">2.3.1</span> asmSymbolicName</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Specifies a symbolic name for the operand. Reference the name in the assembler template by enclosing it in square brackets (i.e. '%[Value]'). The 
scope of the name is the asm statement that contains the definition. Any valid C variable name is acceptable, including names already defined in the surrounding code.
No two operands within the same asm statement can use the same symbolic name.
</p>

<p>
When not using an asmSymbolicName, use the (zero-based) position of the operand in the list of operands in the assembler template.
For example if there are two output operands and three inputs, use '%2' in the template to refer to the first input operand, '%3' for the second, and '%4' for the third.
</p>
</div>
</div>
