inline_asm.org
*** constraint
A string constant specifying constrints on the placement of the operand.

Input constraint strings may not begin with either '=' or '+'. When you list more than one possible location (for example, 'irm'), the compiler chooses the most efficient
one based on the current context. If you must use a specific register, but your Machine Constraints do not privide sufficient control to select the specific register you
want, local register variables may provide a solution.

Input constraints can also be digits (for example, "0"). This indicates that the specified input must be in the same place as the output constraint at the (zero-based) index
in the output constraint list. When using asmSymbolicName syntax for the output operands, you may use these names (enclosed in brackets '[]' instead of digits).

*** cexpression
This is the C varialbe or expression being passed to the asm statement as input. The enclosing parentheses are a required part of the syntax.
When the compiler selects the registers to use to represent the input operands, it does not use any of the clobbered registers.

If there are no output operands but there are input operands, place two consecutive colons where the output operands would go:

#+BEGIN_SRC asm
__asm__ __volatile__("some instructions"
                     : /* No outputs. */
                     : "r" (Offset / 8));
#+END_SRC


** Clobbers and Scratch Registers
While the compiler is aware of changes to entries listed in the output operands the inline asm code may modify more than
just the outputs. For example, calculations may require additional registers, or the processor may overwrite a register 
as a side effect of a particular assembler instruction. In order to inform the compiler of these changes, list them in the 
clobber list. Clobber list items are either register names or the special clobbers (listed below). Each clobber list item
is a string constant enclosed in double quotes and separated by commas.

Clobber descriptions may not in any way overlap with an input or output operand. For example, you may not have an operand 
describing a register class with one member when listing that registerin the clobber list. Varialbes declared to live in 
specific registers and used as asm input or otput operands must have no part mentioned in the clobber description. In particular,
there is no way to specify that input operands get modified without also specifying them as output operands.

When the compiler selects which registers to use to represent input and output operands, it doses not use any of the clobbered registers.
As a result, clobbered registers are available for any use in the assembler code.

Another restriction is that the clobber list should not contain the stack pointer regiset. This is because the compiler requires the value
of the stack pointer to be the same after an asm statement as it was on entry to the statement. However, previous versions of GCC did not enforce
this rule and allowed the stack pointer to appear in the list, with unclear semantics. This behavior is deprecated and listing the stack pointer may become
an error in future versions of GCC.

Here is an example for showing the use of clobbered registers:

#+BEGIN_SRC asm
#define BIT_OP(op, c_op, asm_op)					\
static inline void op##_bit(unsigned long nr, volatile unsigned long *m)\
{									\
	m += nr >> 5;							\
									\
	nr = (1UL << (nr & 0x1f));					\
	if (asm_op == CTOP_INST_AAND_DI_R2_R2_R3)			\
		nr = ~nr;						\
									\
	__asm__ __volatile__(						\
	"	mov r2, %0\n"						\
	"	mov r3, %1\n"						\
	"	.word %2\n"						\
	:								\
	: "r"(nr), "r"(m), "i"(asm_op)					\
	: "r2", "r3", "memory");					\
}
#+END_SRC

Also, there are two special clobber arguments:

|          |                                                                                                            |
| "cc"     | The "cc" clobber indicates that the assmebler code modifies the flags register.                            |
|          | On some machines, GCC represents the condition codes as a specific hareware register;                      |
|          | "cc" serves to name this register. On other machines, condition code handling is different,                |
|          | and specifying "cc" has no effect. But it is valid no matter what the target.                              |
|----------+------------------------------------------------------------------------------------------------------------|
| "memory" | The "memory" clobber tells the compiler that the assembly code performs memory reads or writes             |
|          | to items other than those listed in the input and output operands (for example, accessing the memory       |
|          | pointed to by one of the input parameters). To ensure memory contains correct values, GCC may need to      |
|          | flush specific register values to memory before executing the asm. Further, the compiler dose not assume   |
|          | that any values read from memory before an asm remain unchanged after that asm; it reloads them as needed. |
|          | Using the "memory" clobber effectively forms a read/write memory barrier for the compiler.                 |
|          | Note that this clobber does not prevent the processor from doing speculative reads past the asm statement. |
|          | To prevent that, you need processor-specific fence instructions.                                           |
|----------+------------------------------------------------------------------------------------------------------------|

* More Recipes
** Inline assembler as preprocessor macor
In order to resue your assembler language parts, it is useful to define them as macros and put them into incude files.
Using such files may produce compiler warnings, if they are used in modules, which are compiled in strict ANSI mode.
To avoid that, you can write __asm__ instead of asm and __volatile__ instead of volatile. These are equivalent aliases.
Here is a macro which will convert a long value little endian to big endian or vice versa:

#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

#define BYTESWAP(val) \
    __asm__ __volatile__ ( \
        "eor     r3, %1, %1, ror #16\n" \
        "bic     r3, r3, #0x00FF0000\n" \
        "mov     %0, %1, ror #8\n" \
        "eor     %0, %0, r3, lsr #8" \
        : "=r" (val) \
        : "0" (val) \
        : "r3", "cc" \
    );

int main(void)
{
    uint32_t value = 0xa3a2a1a0;
    BYTESWAP(value);
    printf("value after swaped: %lx\n", value);

    return 0;
}
#+END_SRC

Build and execute above code, it will output "value after swaped: a0a1a2a3" on console.


