inline_asm.org
** C stub functions
Macro definitions will include the same assembler code whenever they are referenced. This may not be acceptable for large routines.
In this case you may define a C stub function. Here is the byte swap procedure again, this time implemented as a C function.

#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

uint32_t ByteSwap(uint32_t val)
{
    asm volatile (
        "eor     r3, %1, %1, ror #16\n"
        "bic     r3, r3, #0x00FF0000\n"
        "mov     %0, %1, ror #8\n"
        "eor     %0, %0, r3, lsr #8"
        : "=r" (val)
        : "0" (val)
        : "r3", "cc"
    );

    return val;
}

int main(void)
{
    uint32_t value = 0xa3a2a1a0;
    value = ByteSwap(value);
    printf("value after swaped: %lx\n", value);

    return 0;
}
#+END_SRC

** Forcing usage of specific registers
A local variable may be held in a register. You can instruct the inline assembler to use a specific register for it.

#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>



static inline void count(void)
{
	register uint32_t count asm("r3") = 0;
	asm volatile(
		"add r3, r3, #1\n"
		: "=r" (count)
		: "0" (count));

	printf("count = %ld\n", count);
}

int main(void)
{
    count();

    return 0;
}
#+END_SRC

Be warned, that this sample is bad in most situations, because it interferes with the compiler's optimizer. 
Furthermore, GCC will not completely reserve the specified register. If the optimizer recognizes that the variable will not
be referenced any longer, the register may be re-used. But the compiler is not able to check whether this register
usage conflicts with any predefined register. If you reserve too many registers in this way, the compiler may even run out of
registers during code generation.

** Using constants
You can use the mov instruction to load an immediate constant value into a register:

#+BEGIN_SRC asm
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

static inline void using_constant(void)
{
	uint32_t flag = 0;
	asm volatile(
		"mov %0, %1\n"
		: "=r" (flag)
		: "I" (0x80));

	printf("flag = %ld\n", flag);
}

int main(void)
{
    using_constant();

    return 0;
}
#+END_SRC

