inline_asm.html


<div id="outline-container-org865d0b4" class="outline-3">
<h3 id="org865d0b4"><span class="section-number-3">3.2</span> C stub functions</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Macro definitions will include the same assembler code whenever they are referenced. This may not be acceptable for large routines.
In this case you may define a C stub function. Here is the byte swap procedure again, this time implemented as a C function.
</p>

<div class="org-src-container">
<pre class="src src-asm">#include &lt;stdint.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

uint32_t ByteSwap(uint32_t val)
{
    asm volatile (
	"eor     r3, %1, %1, ror #16\n"
	"bic     r3, r3, #0x00FF0000\n"
	"mov     %0, %1, ror #8\n"
	"eor     %0, %0, r3, lsr #8"
	: "=r" (val)
	: "0" (val)
	: "r3", "cc"
    );

    return val;
}

int main(void)
{
    uint32_t value = 0xa3a2a1a0;
    value = ByteSwap(value);
    printf("value after swaped: %lx\n", value);

    return 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org13b37dc" class="outline-3">
<h3 id="org13b37dc"><span class="section-number-3">3.3</span> Forcing usage of specific registers</h3>
<div class="outline-text-3" id="text-3-3">
<p>
A local variable may be held in a register. You can instruct the inline assembler to use a specific register for it.
</p>

<div class="org-src-container">
<pre class="src src-asm">#include &lt;stdint.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;



static inline void count(void)
{
	register uint32_t count asm("r3") = 0;
	asm volatile(
		"add r3, r3, #1\n"
		: "=r" (count)
		: "0" (count));

	printf("count = %ld\n", count);
}

int main(void)
{
    count();

    return 0;
}
</pre>
</div>

<p>
Be warned, that this sample is bad in most situations, because it interferes with the compiler's optimizer. 
Furthermore, GCC will not completely reserve the specified register. If the optimizer recognizes that the variable will not
be referenced any longer, the register may be re-used. But the compiler is not able to check whether this register
usage conflicts with any predefined register. If you reserve too many registers in this way, the compiler may even run out of
registers during code generation.
</p>
</div>
</div>

<div id="outline-container-org6b2b118" class="outline-3">
<h3 id="org6b2b118"><span class="section-number-3">3.4</span> Using constants</h3>
<div class="outline-text-3" id="text-3-4">
<p>
You can use the mov instruction to load an immediate constant value into a register:
</p>

<div class="org-src-container">
<pre class="src src-asm">#include &lt;stdint.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

static inline void using_constant(void)
{
	uint32_t flag = 0;
	asm volatile(
		"mov %0, %1\n"
		: "=r" (flag)
		: "I" (0x80));

	printf("flag = %ld\n", flag);
}

int main(void)
{
    using_constant();

    return 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d91960" class="outline-2">
<h2 id="org4d91960"><span class="section-number-2">4</span> References:</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="http://www.ethernut.de/en/documents/arm-inline-asm.html">http://www.ethernut.de/en/documents/arm-inline-asm.html</a></li>
<li><a href="https://gcc.gnu.org/onlinedocs/gcc/Extended-Asm.html">https://gcc.gnu.org/onlinedocs/gcc/Extended-Asm.html</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-10-07 Wed 00:00</p>
<p class="author">Author: yannik</p>
<p class="date">Created: 2020-10-08 Thu 17:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
